balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F1010.PIC
        <edc:AdjustPoint edc:offset="632"/>
        <edc:SFRDef edc:access="nn------nnnnnn-n" edc:cname="RCON" edc:desc="" edc:impl="0xc0fd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------1uuuuu-u" edc:name="RCON" edc:nzwidth="0x10" edc:por="00------000000-1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-nnnn-rncn-n" edc:cname="OSCCON" edc:desc="" edc:impl="0x77bd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-yyy-yyy0-0000-0" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="-yyy-yyy0-0000-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TSEQEN" edc:desc="" edc:mask="0x1" edc:name="TSEQEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRCDEN" edc:desc="" edc:mask="0x1" edc:name="PRCDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:desc="" edc:mask="0x1" edc:name="NOSC2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:desc="" edc:mask="0x1" edc:name="COSC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OSCTUN" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0xf" edc:name="TUN" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ1" edc:desc="" edc:mask="0xf" edc:name="TSEQ1" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ2" edc:desc="" edc:mask="0xf" edc:name="TSEQ2" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ3" edc:desc="" edc:mask="0xf" edc:name="TSEQ3" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ10" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ11" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ12" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ13" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ20" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ21" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ22" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ23" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ30" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ31" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ32" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ33" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ33" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
