balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F1010.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OSCTUN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OSCTUN2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEQ4" edc:desc="" edc:mask="0xf" edc:name="TSEQ4" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ5" edc:desc="" edc:mask="0xf" edc:name="TSEQ5" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ6" edc:desc="" edc:mask="0xf" edc:name="TSEQ6" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TSEQ7" edc:desc="" edc:mask="0xf" edc:name="TSEQ7" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEQ40" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ41" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ42" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ43" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ50" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ51" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ52" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ53" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ60" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ61" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ62" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ63" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ70" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ71" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ72" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEQ73" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="TSEQ73" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="LFSR" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000" edc:name="LFSR" edc:nzwidth="0x10" edc:por="-000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LFSR" edc:desc="" edc:mask="0x7fff" edc:name="LFSR" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="BSRAM" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------000" edc:name="BSRAM" edc:nzwidth="16" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RL_BSR" edc:desc="" edc:mask="0x1" edc:name="RL_BSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IR_BSR" edc:desc="" edc:mask="0x1" edc:name="IR_BSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IW_BSR" edc:desc="" edc:mask="0x1" edc:name="IW_BSR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="nnn----n-nnnnnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0-0000000" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="000----0-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0x7f" edc:name="PROGOP" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TWRI" edc:desc="" edc:mask="0x1" edc:name="TWRI" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP4" edc:desc="" edc:mask="0x1" edc:name="PROGOP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP5" edc:desc="" edc:mask="0x1" edc:name="PROGOP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP6" edc:desc="" edc:mask="0x1" edc:name="PROGOP6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
